// 1. поменять массив в обратном порядке - [1,2,3,4,5,6] [6,5,4,3,2,1]

let arr = [1, 2, 3, 4, 5, 6];
function reverseArr() {
    return arr.reverse();
}


// 2. найти максимальное значение числа в массиве ([3,67,15...])
// 3. записать в массив ряд фибоначчи начиная с N члена с длинной массива M
// 4. даны 2 4-х значных числа с неповторяющимися цифрами, надо определить сколько цифр в этих числах совпадают 
// по значению и позиции и сколько только по значению (3487 и 3794 ---> 1 и 2 )
// 5. сортировка массива по возрастанию/убыванию
// 6. удалить из массива все повторяющиеся элементы